app/Controllers/AdminController.php

    public function dashboard()
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/')->with('error', 'Vous devez être connecté.');
        }

        $role = session()->get('role');
        if ($role !== 'admin' && $role !== 'Admin' && $role !== 'administrateur') {
            return redirect()->to('/dashboard')->with('error', 'Accès refusé.');
        }

        $totalEmployes = count($this->employeModel->findAll());
        $totalDemandes = count($this->congeModel->findAll());
        $demandesEnAttente = count($this->congeModel->where('statut', 'en_attente')->findAll());
---
SELECT *
FROM `employes`
SELECT *
FROM `conges`
SELECT *
FROM `conges`
WHERE `statut` = 'en_attente'

    public function employes()
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/')->with('error', 'Vous devez être connecté.');
        }

        $employes = $this->employeModel->findAll();
---
SELECT *
FROM `employes`