app/Controllers/EmployeController.php

    public function login()
    {
        $firstEmploye = $this->employeModel->first();
---
SELECT *
FROM `employes`
 LIMIT 1