app/Controllers/ProfilController.php

    public function index()
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/')
                ->with('error', 'Vous devez être connecté pour accéder à cette page.');
        }

        $employeId = session()->get('user_id');
        $employe = $this->employeModel->find($employeId);
---
SELECT *
FROM `employes`
WHERE `employes`.`id` = 1