app/Controllers/RHController.php

SELECT `conges`.*, `types_conge`.`libelle` as `type_conge`, `employes`.`nom`, `employes`.`prenom`, `employes`.`email`
FROM `conges`
JOIN `types_conge` ON `conges`.`type_conge_id` = `types_conge`.`id`
JOIN `employes` ON `conges`.`employe_id` = `employes`.`id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` DESC
---
    public function demandes()
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/')->with('error', 'Vous devez être connecté.');
        }

        $role = session()->get('role');
        if ($role !== 'rh' && $role !== 'RH' && $role !== 'Responsable RH') {
            return redirect()->to('/dashboard')->with('error', 'Accès refusé.');
        }

        // Récupérer toutes les demandes en attente
        $demandesEnAttente = $this->congeModel
            ->select('conges.*, types_conge.libelle as type_conge, employes.nom, employes.prenom, employes.email')
            ->join('types_conge', 'conges.type_conge_id = types_conge.id')
            ->join('employes', 'conges.employe_id = employes.id')
            ->where('conges.statut', 'en_attente')
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();

SELECT *
FROM `employes`
SELECT *
FROM `soldes`
WHERE `employe_id` = 1
AND `annee` = 2026
---
    public function soldes()
    {
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/')->with('error', 'Vous devez être connecté.');
        }

        $annee = (int) date('Y');
        $employes = $this->employeModel->findAll();
        $types = $this->typeCongeModel->findAll();

        $soldesParEmploye = [];
        foreach ($employes as $employe) {
            $soldes = $this->soldeModel
                ->where('employe_id', (int) $employe['id'])
                ->where('annee', $annee)
                ->findAll();