app/Models/CongeModel.php

    public function getDemandeCongesEnAttente(): array
    {
        return $this->where('statut', 'en_attente')->findAll();
---
SELECT *
FROM `conges`
WHERE `statut` = 'en_attente'

    public function demanderConge(array $data): int|false
    {
        return $this->insert($data);
---
INSERT INTO `conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `statut`) VALUES ('1', '1', '2026-05-13', '2026-05-15', 3, 'ilycvv', 'en_attente')

    public function getCongesAvecDetails(int $conge_id = null): array
    {
        $query = $this->db->table($this->table)
                          ->select('conges.*, employes.nom, employes.prenom, employes.email, departements.nom as departement_nom')
                          ->join('employes', 'employes.id = conges.employe_id', 'left')
                          ->join('departements', 'departements.id = employes.departement_id', 'left');

        if ($conge_id !== null) {
            $query->where('conges.id', $conge_id);
            return $query->get()->getResultArray();
        }

        return $query->get()->getResultArray();
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`email`, `departements`.`nom` as `departement_nom`
FROM `conges`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`