app/Models/CongeModel.php

    public function insertConge(array $data): int
    {
        $this->insert($data);
---
INSERT INTO `conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `commentaire_rh`, `created_at`, `updated_at`) VALUES (1, '4', '2026-05-14', '2026-05-31', 17, 'idk', '', '2026-05-13 07:46:09', '2026-05-13 07:46:09')

    public function getCongesAvecDetails(int $conge_id = null): array
    {
        $query = $this->db->table($this->table)
                          ->select('conges.*, employes.nom, employes.prenom, employes.email, departements.nom as departement_nom')
                          ->join('employes', 'employes.id = conges.employe_id', 'left')
                          ->join('departements', 'departements.id = employes.departement_id', 'left');
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`email`, `departements`.`nom` as `departement_nom`
FROM `conges`
LEFT JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`