app/Models/DepartementModel.php

    public function getAllDepartements()
    {
        return $this->findAll();
---
SELECT *
FROM `departements`