app/Models/EmployeModel.php

SELECT *
FROM `employes`
WHERE `email` = 'admin@techmada.mg'
 LIMIT 1
---
    public function checkEmploye(string $email, string $password): ?array
    {
        $user = $this->where('email', $email)->first();

SELECT *
FROM `employes`
---
    public function getAllEmployes()
    {
        return $this->findAll();