app/Models/SoldeModel.php

SELECT *
FROM `soldes`
WHERE `employe_id` = 1
AND `type_conge_id` = 1
 LIMIT 1
---
    public function getSoldeByEmployeIdAndTypeCongeId(int $employeId, int $typeCongeId): ?array
    {
        return $this->where('employe_id', $employeId)
                    ->where('type_conge_id', $typeCongeId)
                    ->first();