app/Models/SoldeModel.php

    public function getSoldeEmploye(int $employe_id, int $type_conge_id, int $annee)
    {
        return $this->where('employe_id', $employe_id)
                    ->where('type_conge_id', $type_conge_id)
                    ->where('annee', $annee)
                    ->first();
---
SELECT *
FROM `soldes`
WHERE `employe_id` = 1
AND `type_conge_id` = 1
AND `annee` = 2026
 LIMIT 1

    public function creerSolde(int $employe_id, int $type_conge_id, int $annee, int $jours_attribues)
    {
        $data = [
            'employe_id'      => $employe_id,
            'type_conge_id'   => $type_conge_id,
            'annee'           => $annee,
            'jours_attribues' => $jours_attribues,
            'jours_pris'      => 0,
        ];
        return $this->insert($data);
---
INSERT INTO `soldes` (`employe_id`, `type_conge_id`, `annee`, `jours_attribues`, `jours_pris`) VALUES (1, 1, 2026, 20, 0)